InformationRegisters/ДанныеЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеЗадачи</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачиОбщие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыОбщихЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыОбщихЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вопрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыВерсийСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыВерсийСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщаяЗадача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рекламация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Рекламации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Рекламации</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедущийКонструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстановитьПроизводство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущаяСтатдияПроизводства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныРекламации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РКДВыполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ЗадачиОбщиеПрисоединенныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЗадачиОбщиеПрисоединенныеФайлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачиОбщие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиСинхронизацииФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМодификацииУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зашифрован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиСинхронизацииФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактирует</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиСинхронизацииФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИзвлеченияТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИзвлеченияТекстаФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипХраненияФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Том</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТомаХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омЗадачаОбщаяНаСервере/Ext/Module.bsl
Функция ПолучитьСтруктуруДляИзмененияИсполнителя(Конструктор = Неопределено, КонструкторНеНужен = Истина, ТолькоКонструктор = Ложь) Экспорт

	СтруктуруДляИзменения = Новый Структура();
	
	Если ТолькоКонструктор Тогда
	   	СтруктуруДляИзменения.Вставить("Конструктор", Конструктор);
	Иначе
		
		СтруктуруДляИзменения.Вставить("ВедущийКонструктор");
		СтруктуруДляИзменения.Вставить("Дизайнер");
		СтруктуруДляИзменения.Вставить("Менеджер");
		Если НЕ КонструкторНеНужен Тогда
			СтруктуруДляИзменения.Вставить("Конструктор", Конструктор);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктуруДляИзменения;

КонецФункции // ПолучитьСтруктуруДляИзмененияКонструктора()

Процедура ИзменитьИсполнителяЗадачиОбщей(СтруктуруДляИзменения, ОбъектАдресации) Экспорт //Не использовать

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиОбщие.Ссылка КАК Задача,
		|	ЗадачиОбщие.Исполнитель КАК Исполнитель
		|ИЗ
		|	Задача.ЗадачиОбщие КАК ЗадачиОбщие
		|ГДЕ
		|	ЗадачиОбщие.ОбъектАдресации = &ОбъектАдресации
		|	И НЕ ЗадачиОбщие.ДолжностьИсполнителя = """"";
	
	Запрос.УстановитьПараметр("ОбъектАдресации", ОбъектАдресации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	

	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ДанныеЗадачи.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Задача = Выборка.Задача;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.Задача = Выборка.Задача;
		
		Исполнитель = МенеджерЗаписи.Исполнитель;
		Если Выборка.ДолжностьИсполнителя = "Ведущий конструктор" И СтруктуруДляИзменения.Свойство("ВедущийКонструктор") Тогда
			Исполнитель 	= СтруктуруДляИзменения.ВедущийКонструктор;
		ИначеЕсли Выборка.ДолжностьИсполнителя = "Дизайнер" И СтруктуруДляИзменения.Свойство("Дизайнер") Тогда
			Исполнитель 	= СтруктуруДляИзменения.Дизайнер;
		ИначеЕсли Выборка.ДолжностьИсполнителя = "Менеджер" И СтруктуруДляИзменения.Свойство("Менеджер") Тогда
			Исполнитель 	= СтруктуруДляИзменения.Менеджер;
		ИначеЕсли Выборка.ДолжностьИсполнителя = "Конструктор" И СтруктуруДляИзменения.Свойство("Конструктор") Тогда
			Исполнитель 	= СтруктуруДляИзменения.Конструктор;
		Иначе
		    Продолжить;
		КонецЕсли; 
		
		Если НЕ МенеджерЗаписи.Исполнитель = Исполнитель Тогда
			МенеджерЗаписи.Исполнитель = Исполнитель;
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьТаблицуОбщихЗадач(СтруктураПараметров) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиОбщие.Ссылка КАК Задача,
		|	ЗадачиОбщие.Дата КАК Дата,
		|	ЗадачиОбщие.Наименование КАК Наименование,
		|	ЗадачиОбщие.ОжидаемаяДатаВыполнения КАК ОжидаемаяДатаВыполнения,
		|	ЗадачиОбщие.Автор КАК Автор,
		|	ЗадачиОбщие.АвторИсполнения КАК АвторИсполнения,
		|	ЗадачиОбщие.ОбъектАдресации КАК ОбъектАдресации,
		|	ЗадачиОбщие.Проект КАК Проект,
		|	ЗадачиОбщие.СвязаннаяЗадача КАК СвязаннаяЗадача,
		|	ЗадачиОбщие.ТипЗадачи КАК ТипЗадачи,
		|	ЗадачиОбщие.Выполнена КАК Выполнена,
		|	ЗадачиОбщие.Сообщение КАК Сообщение,
		|	ДанныеЗадачи.Исполнитель КАК Исполнитель,
		|  	[Картинка] КАК Картинка,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗадачиОбщиеПрисоединенныеФайлы.Ссылка) КАК КоличествоФайлов
		|ИЗ
		|	Задача.ЗадачиОбщие КАК ЗадачиОбщие
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗадачиОбщиеПрисоединенныеФайлы КАК ЗадачиОбщиеПрисоединенныеФайлы
		|		ПО ЗадачиОбщиеПрисоединенныеФайлы.ВладелецФайла = ЗадачиОбщие.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеЗадачи.СрезПоследних КАК ДанныеЗадачи
		|		ПО ДанныеЗадачи.Задача = ЗадачиОбщие.Ссылка";		
	
	ГДЕ_добавлен = Ложь;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Исполнитель) И ЗначениеЗаполнено(СтруктураПараметров.Автор) Тогда
		
		Если СтруктураПараметров.Наблюдатель Тогда
			
			ЗаменаКартинки = "ВЫБОР КОГДА НаблюдателиЗаЗадачей.Наблюдатель = &Исполнитель ТОГДА 2 
			| КОГДА ЗадачиОбщие.Автор = &Автор ТОГДА 1 ИНАЧЕ 0 КОНЕЦ
			|"; 
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "[Картинка]", ЗаменаКартинки);
			
			Запрос.Текст = Запрос.Текст + "
			|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачиОбщие.Наблюдатели КАК НаблюдателиЗаЗадачей
			|		ПО НаблюдателиЗаЗадачей.Ссылка = ЗадачиОбщие.Ссылка";
			
			

			Если СтруктураПараметров.МоиЗадачи И СтруктураПараметров.ДляМеня Тогда
				
				ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
				Запрос.Текст = Запрос.Текст + "(ДанныеЗадачи.Исполнитель = &Исполнитель ИЛИ
				|ЗадачиОбщие.Автор = &Автор ИЛИ НаблюдателиЗаЗадачей.Наблюдатель = &Исполнитель)";
				
				Запрос.УстановитьПараметр("Автор", 			СтруктураПараметров.Автор);
				
			ИначеЕсли СтруктураПараметров.МоиЗадачи Тогда
				ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
				Запрос.Текст = Запрос.Текст + "(ЗадачиОбщие.Автор = &Автор ИЛИ НаблюдателиЗаЗадачей.Наблюдатель = &Исполнитель)";
				
				Запрос.УстановитьПараметр("Автор", СтруктураПараметров.Автор);
			ИначеЕсли СтруктураПараметров.ДляМеня Тогда
				ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
				Запрос.Текст = Запрос.Текст + "(ДанныеЗадачи.Исполнитель = &Исполнитель  ИЛИ НаблюдателиЗаЗадачей.Наблюдатель = &Исполнитель)";
				Запрос.УстановитьПараметр("Автор", СтруктураПараметров.Автор);
			Иначе
				ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
				Запрос.Текст = Запрос.Текст + "НаблюдателиЗаЗадачей.Наблюдатель = &Исполнитель";
				Запрос.УстановитьПараметр("Автор", СтруктураПараметров.Автор);
			КонецЕсли;
		
			Запрос.УстановитьПараметр("Исполнитель", 	СтруктураПараметров.Исполнитель);
		Иначе
			
			Если СтруктураПараметров.МоиЗадачи И СтруктураПараметров.ДляМеня Тогда
				
				ЗаменаКартинки = "ВЫБОР КОГДА ЗадачиОбщие.Автор = &Автор ТОГДА 1 ИНАЧЕ 0 КОНЕЦ 
				|"; 
				
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "[Картинка]", ЗаменаКартинки);
				ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
				Запрос.Текст = Запрос.Текст + "(ДанныеЗадачи.Исполнитель = &Исполнитель ИЛИ
				|ЗадачиОбщие.Автор = &Автор)";
				Запрос.УстановитьПараметр("Исполнитель", 	СтруктураПараметров.Исполнитель);
				Запрос.УстановитьПараметр("Автор", 			СтруктураПараметров.Автор);
				
			ИначеЕсли СтруктураПараметров.МоиЗадачи Тогда
				ЗаменаКартинки = "1 
				|"; 
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "[Картинка]", ЗаменаКартинки);
				ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
				Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.Автор = &Автор";
				Запрос.УстановитьПараметр("Автор", СтруктураПараметров.Автор);
			ИначеЕсли СтруктураПараметров.ДляМеня Тогда
				ЗаменаКартинки = "0 
				|"; 
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "[Картинка]", ЗаменаКартинки);
				ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
				Запрос.Текст = Запрос.Текст + "ДанныеЗадачи.Исполнитель = &Исполнитель";
				Запрос.УстановитьПараметр("Исполнитель", СтруктураПараметров.Исполнитель);
			Иначе
				Возврат Новый ТаблицаЗначений;
			КонецЕсли;
			
		КонецЕсли;		
		
	Иначе
		
		Если НЕ (ЗначениеЗаполнено(СтруктураПараметров.Автор) ИЛИ ЗначениеЗаполнено(СтруктураПараметров.Исполнитель)) Тогда 
			ЗаменаКартинки = "0 
			|"; 
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "[Картинка]", ЗаменаКартинки);
			
		Иначе
			
			Если ЗначениеЗаполнено(СтруктураПараметров.Исполнитель) Тогда
				
				ЗаменаКартинки = "0 
				|"; 
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "[Картинка]", ЗаменаКартинки);
				ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
				Запрос.Текст = Запрос.Текст + "ДанныеЗадачи.Исполнитель = &Исполнитель";
				Запрос.УстановитьПараметр("Исполнитель", СтруктураПараметров.Исполнитель);
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтруктураПараметров.Автор) Тогда
				
				ЗаменаКартинки = "1 
				|"; 
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "[Картинка]", ЗаменаКартинки);
				ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
				Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.Автор = &Автор";
				Запрос.УстановитьПараметр("Автор", СтруктураПараметров.Автор);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(СтруктураПараметров.АвторИсполнения) Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.АвторИсполнения = &АвторИсполнения";
		Запрос.УстановитьПараметр("АвторИсполнения", СтруктураПараметров.АвторИсполнения);
	
	КонецЕсли;
	
	Если СтруктураПараметров.НеВыполненые Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "НЕ ЗадачиОбщие.Выполнена";
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ДатаОкончания) Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.Дата <= &ДатаОкончания";
		Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.ДатаОкончания);
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ДатаНачала) Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.Дата >= &ДатаНачала";
		Запрос.УстановитьПараметр("ДатаНачала", СтруктураПараметров.ДатаНачала);
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Направление) Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.Направление = &Направление";
		Запрос.УстановитьПараметр("Направление", СтруктураПараметров.Направление);
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ТипЗадачи) Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.ТипЗадачи = &ТипЗадачи";
		Запрос.УстановитьПараметр("ТипЗадачи", СтруктураПараметров.ТипЗадачи);
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ОбъектАдресации) Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.ОбъектАдресации = &ОбъектАдресации";
		Запрос.УстановитьПараметр("ОбъектАдресации", СтруктураПараметров.ОбъектАдресации);
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Проект) Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.Проект = &Проект";
		Запрос.УстановитьПараметр("Проект", СтруктураПараметров.Проект);
	
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтруктураПараметров.СообщениеСодержит) Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.Сообщение Подобно &СообщениеСодержит";
		Запрос.УстановитьПараметр("СообщениеСодержит", СтруктураПараметров.СообщениеСодержит);
	
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтруктураПараметров.ИсполнениеСодержит) Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.Исполнение Подобно &ИсполнениеСодержит";
		Запрос.УстановитьПараметр("ИсполнениеСодержит", СтруктураПараметров.ИсполнениеСодержит);
	
	КонецЕсли;
	
	
	Запрос.Текст = Запрос.Текст + "
	|СГРУППИРОВАТЬ ПО
	|	ЗадачиОбщие.Ссылка,
	|	ЗадачиОбщие.Дата,
	|	ЗадачиОбщие.Наименование,
	|	ЗадачиОбщие.ОжидаемаяДатаВыполнения,
	|	ЗадачиОбщие.Направление,
	|	ЗадачиОбщие.Автор,
	|	ЗадачиОбщие.АвторИсполнения,
	|	ЗадачиОбщие.ОбъектАдресации,
	|	ЗадачиОбщие.Проект,
	|	ЗадачиОбщие.СвязаннаяЗадача,
	|	ЗадачиОбщие.ТипЗадачи,
	|	ЗадачиОбщие.Выполнена,
	|	ЗадачиОбщие.Сообщение,
	|	ДанныеЗадачи.Исполнитель,
	|	ЗадачиОбщие.Исполнение," + "
	|	" + ЗаменаКартинки;  
	
	Если НЕ ПустаяСтрока(СтруктураПараметров.СтрокаСортировки) Тогда
		Запрос.Текст = Запрос.Текст + "	УПОРЯДОЧИТЬ ПО " + СтруктураПараметров.СтрокаСортировки;
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // СформироватьТаблицуОбщихЗадач()

Процедура ДобавитьГДЕ(ЗапросТекст, ГДЕ_добавлен)
	
	Если НЕ ГДЕ_добавлен Тогда
		ГДЕ_добавлен = Истина;
		ЗапросТекст = ЗапросТекст+ "		
		|ГДЕ
		|"
	Иначе
		ЗапросТекст = ЗапросТекст+ "		
		|И ";
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруПараметровДляТаблицыОбщихЗадач() Экспорт

	
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("АвторИсполнения", 	Справочники.Пользователи.ПустаяСсылка());
	СтруктураПараметров.Вставить("Автор", 				Справочники.Пользователи.ПустаяСсылка());
	СтруктураПараметров.Вставить("Исполнитель", 		ПараметрыСеанса.ТекущийПользователь);
	СтруктураПараметров.Вставить("ОбъектАдресации", 	);
	СтруктураПараметров.Вставить("Направление", 		Справочники.НаправленияОбщихЗадач.ПустаяСсылка());
	СтруктураПараметров.Вставить("Проект", 				Справочники.Проекты.ПустаяСсылка());
	СтруктураПараметров.Вставить("ТипЗадачи", 			Перечисления.ТипыОбщихЗадач.ПустаяСсылка());
	СтруктураПараметров.Вставить("ДатаОкончания", 		Дата(1, 1, 1));
	СтруктураПараметров.Вставить("ДатаНачала", 			СтруктураПараметров.ДатаОкончания);
	СтруктураПараметров.Вставить("НеВыполненые", 		Истина);
	СтруктураПараметров.Вставить("ДляМеня", 			Ложь);
	СтруктураПараметров.Вставить("МоиЗадачи", 			Истина);
	СтруктураПараметров.Вставить("Наблюдатель", 		Истина);
	СтруктураПараметров.Вставить("ИсполнениеСодержит", 	"");
	СтруктураПараметров.Вставить("СообщениеСодержит", 	"");
	СтруктураПараметров.Вставить("СтрокаСортировки", 	"Дата, Наименование");
	
	Возврат СтруктураПараметров;

КонецФункции // ПолучитьСтруктуруПараметровДляТаблицыОбщихЗадач()   

Функция СозданиеОбщейЗадачи(ОбъектТЗ, Параметр = Неопределено) Экспорт
	
	ТипОбъекта = ТипЗнч(ОбъектТЗ);
	
    Если ТипОбъекта = Тип("ДокументСсылка.Рекламации") Тогда
	
		Возврат ПроверкаСозданиеЗадачиРекламация(ОбъектТЗ, Параметр);	
	
	Иначе
	
		
	
	КонецЕсли;
	

КонецФункции // СозданиеОбщейЗадачи() 

Процедура ЗаписатьИсполнителяНаСервере(Задача, Исполнитель) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеЗадачиСрезПоследних.Исполнитель КАК Исполнитель
		|ИЗ
		|	РегистрСведений.ДанныеЗадачи.СрезПоследних(, Задача = &Задача) КАК ДанныеЗадачиСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Исполнитель = Выборка.Исполнитель Тогда
		
		Возврат;	
		
		КонецЕсли;	
	КонецЦикла;
	
	МенеджерЗаписи = РегистрыСведений.ДанныеЗадачи.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период 		= ТекущаяДата();
	МенеджерЗаписи.Задача 		= Задача;
	МенеджерЗаписи.Исполнитель 	= Исполнитель;
	
	МенеджерЗаписи.Записать();
		
КонецПроцедуры // ЗаписатьИсполнителяНаСервере(Объект.Ссылка, Исполнитель)

Функция СоздатьЗадачуИнформация(ТекстОповещения, Проект, ОбъектАдресации, АвторИсполнения) Экспорт
	
	ЗадачаОповещение 							= Задачи.ЗадачиОбщие.СоздатьЗадачу();
	ЗадачаОповещение.Автор 						= ПараметрыСеанса.ТекущийПользователь;
	ЗадачаОповещение.Дата 						= ТекущаяДата();
	ЗадачаОповещение.ОжидаемаяДатаВыполнения	= омДаты.ДобавитьДниСУчетомВыходных(ЗадачаОповещение.Дата, 1);
	ЗадачаОповещение.Наименование 				= ТекстОповещения;
	ЗадачаОповещение.НуженОтчетОВыполнении 		= Ложь;
	ЗадачаОповещение.Проект 					= Проект; 
	ЗадачаОповещение.СвязаннаяЗадача 			= Неопределено;
	ЗадачаОповещение.Направление 				= Справочники.НаправленияОбщихЗадач.СозданНовыйДокументЗадача;
	ЗадачаОповещение.ТипЗадачи 					= Перечисления.ТипыОбщихЗадач.Информация;
	ЗадачаОповещение.Сообщение 					= ТекстОповещения;
	ЗадачаОповещение.ОбъектАдресации			= ОбъектАдресации;
	
	ЗадачаОповещение.Записать(); 
	
	омЗадачаОбщаяНаСервере.ЗаписатьИсполнителяНаСервере(ЗадачаОповещение.Ссылка, АвторИсполнения);
	РегистрыСведений.ВерсииОбщихЗадач.УвеличитьВерсию(Перечисления.ТипыВерсийСообщений.ОбщаяЗадача);
	
КонецФункции // СоздатьЗадачуИнформация()


#Область Рекламация

Функция ПроверкаСозданиеЗадачиРекламация(Рекламация, Параметр)

	РежимЗаписиРекламации = Неопределено;
	
	Если НЕ Параметр.Свойство("РежимЗаписиДокумента", РежимЗаписиРекламации) Тогда
	
		Возврат Неопределено;	
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рекламации.Проведен КАК Проведен,
		|	Рекламации.ВедущийКонструктор КАК ВедущийКонструктор,
		|	Рекламации.Конструктор КАК Конструктор,
		|	Рекламации.Проект КАК Проект
		|ИЗ
		|	Документ.Рекламации КАК Рекламации
		|ГДЕ
		|	Рекламации.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Рекламация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Проект = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		Проект 				= Выборка.Проект;
		ВедущийКонструктор 	= Выборка.ВедущийКонструктор;
		Конструктор 		= Выборка.Конструктор;
		Проведен 			= Выборка.Проведен;
		
	КонецЦикла;
	
	Если РежимЗаписиРекламации = РежимЗаписиДокумента.Запись Тогда
		
		ТекстОповещения = "Создана рекламация";
		Исполнитель 	= ВедущийКонструктор;
		
	Иначе
		
		ТекстОповещения = "Создана задача по рекламации";
		Исполнитель 	= Конструктор;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Исполнитель) Тогда
	
		Возврат Неопределено;	
	
	КонецЕсли;
	
	ЗадачаРекламации = ЕстьЗадачаРекламации(Рекламация, Исполнитель);
	
	Если ЗначениеЗаполнено(ЗадачаРекламации) Тогда
	
		Возврат ЗадачаРекламации;	
	
	КонецЕсли; 
	
	
	Возврат СоздатьЗадачуИнформация(ТекстОповещения, Проект, Рекламация, Исполнитель);
	

КонецФункции // ПроверкаСозданиеЗадачиРекламация(Рекламация)  

Функция ЕстьЗадачаРекламации(Рекламация, Исполнитель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиОбщие.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ЗадачиОбщие КАК ЗадачиОбщие
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеЗадачи.СрезПоследних КАК ДанныеЗадачиСрезПоследних
		|		ПО ДанныеЗадачиСрезПоследних.Задача = ЗадачиОбщие.Ссылка
		|ГДЕ
		|	ЗадачиОбщие.ОбъектАдресации = &ОбъектАдресации
		|	и ДанныеЗадачиСрезПоследних.Исполнитель = &Исполнитель
		|	И ЗадачиОбщие.СвязаннаяЗадача = ЗНАЧЕНИЕ(Задача.ЗадачиОбщие.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ОбъектАдресации", 	Рекламация);
	Запрос.УстановитьПараметр("Исполнитель", 		Исполнитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Задачи.Задачи_РКД.ПустаяСсылка();
	
КонецФункции // ЕстьЗадачаРекламации(Рекламация)

	
#КонецОбласти
